
[A_Frostbite_Ability H7HeroAbility]
mName="Обморожение"
mTooltip="В начале каждого своего хода вражеский отряд получает от %buff1.buff.d1.min до %buff1.buff.d1.max ед. урона от %ICON_WATER магии воды за каждый негативный эффект магии воды на цели."
[A_Frostbite_CreatureAbility H7CreatureAbility]
mName="Обморожение"
[A_WaterFlowsFreely_Ability H7HeroAbility]
mName="Свободное течение"
[A_WaterMagic_Skill H7Skill]
mName="Магия воды"
mTooltip="Позволяет изучать в гильдии магов заклинания магии воды, а также усиливать их и добавлять дополнительные эффекты."
mDescriptions[2]="Увеличивает эффективность заклинаний магии воды и повышает уровень %ICON_ARCANE_KNOWLEDGE магических знаний на 1."
mDescriptions[3]="Увеличивает эффективность заклинаний магии воды и дополнительно повышает уровень %ICON_ARCANE_KNOWLEDGE магических знаний на 2."
mDescriptions[4]="Увеличивает эффективность заклинаний магии воды и дополнительно повышает уровень %ICON_ARCANE_KNOWLEDGE магических знаний на 3."
mDescriptions[0]="Увеличивает эффективность заклинаний магии воды и повышает уровень %ICON_ARCANE_KNOWLEDGE магических знаний."
[A_Frostbite_Buff H7BaseBuff]
mName="Обморожение"
[A_WaterScholar_Ability H7HeroAbility]
mName="Искусный маг воды"
mTooltip="-%special.norm% к расходу маны на заклинания школы воды."
[A_WaterWisdom_Ability H7HeroAbility]
mName="Мудрость воды"
mTooltip="%stat1 к %stat1.icon магии для заклинаний магии воды. Любой навык категории «Мудрость» дополнительно дает герою %stat1 к %stat1.icon магии."
[A_WaterShield_Ability H7HeroAbility]
mName="Щит воды"
mTooltip="В начале боя все дружественные отряды получают щит воды. Урон, который они получат от первой атаки противника будет снижен на %buff.buff.res.norm. Длительность (ходов): %buff.buff.durini."
[A_WaterShield_Buff H7BaseBuff]
mName="Щит воды"
mTooltip="Урон от следующей атаки противника будет снижен на %res.norm. Действие эффекта длится %durnow хода(ов) и прекращается, если существо получает урон."

[A_Chill_Ability H7HeroAbility]
mName="Охлаждение"
mTooltip="Все атакующие заклинания магии воды, а также передвижение по замерзшей земле, накладывают на выбранные отряды эффект "Онемение", снижая их инициативу на 20 ед. до наступления их следующего хода."
[A_DeepFreeze_Ability H7HeroAbility]
mName="Вечная мерзлота"
mTooltip="Скорость перемещения отрядов, поражённых заклинанием "Ледяная стрела", снижена на 3 ед., но не может быть меньше 1 до конца раунда."
[A_ImprovedTier1Spells_Ability H7HeroAbility]
mName="Знание магии воды I"
mTooltip="%spell1.name: теперь заклинание не перестает действовать, если существо наносит или получает урон в ближнем бою.\n%spell2.name: теперь негативный эффект заклинания, уменьшающий дальность перемещения отряда, длится в течение %spell2.spell.buff1.buff.buff.buff.durini2 хода(ов)."
[A_ImprovedTier2Spells_Ability H7HeroAbility]
mName="Знание магии воды II"
mTooltip="Все отряды, получающие урон от заклинаний "Ледяная стрела" или "Мощь льда" получают эффект "Вечная мерзлота", который снижает дальность их перемещения на 3 ед. на 3 хода."
[A_ImprovedTier3Spells_Ability H7HeroAbility]
mName="Знание магии воды III"
mTooltip="Заклинание "Водяная пелена" также увеличивает дальность перемещения на 5 ед. Заклинание "Кольцо холода" также накладывает "Вечную мерзлоту", которая снижает дальность перемещения отряда на 3 ед. на 3 хода."
[A_PersistentFog_Ability H7HeroAbility]
mName="Постоянный туман"
mTooltip="Пелена тумана не убирается путём нанесения или получения урона в ближнем бою."
[A_ProtectiveMembrane_Ability H7HeroAbility]
mName="Защитная пелена"
mTooltip="В начале боя даёт каждому дружественному отряду защиту от 25% первого полученного урона в течение 3 ходов."
[A_ProtectiveMembrane_Buff H7BaseBuff]
mName="Защитная пелена"
mTooltip="Первый урон, наносимый этому отряду, снижен на 25%."
[A_WaterFlowsFreely_Ability H7HeroAbility]
mName="Вода течет свободно"
mTooltip="Водяная пелена также увеличивает дальность перемещения выбранного дружественного существа на 5 ед."
[A_WreckingTsunami_Ability H7HeroAbility]
mName="Разрушительное цунами"
mTooltip="Цунами дополнительно наносит урон от магии воды всем разрушаемым преградам в выбранной области."

7.5_mod : 

[A_MasterOfWater_I_Ability H7HeroAbility]
mName="Знание магии воды I"
mTooltip="%spell1.name: теперь заклинание не перестает действовать, если существо получает урон.\n%spell2.name: теперь негативный эффект заклинания, уменьшающий дальность перемещения отряда, длится в течение %spell2.spell.buff1.buff.durini2 хода(ов)."


7.5_v2

[A_MasterOfWater_III_Ability H7HeroAbility]
mName="Знание магии воды III"
mTooltip="%spell1.name: теперь заклинание дополнительно увеличивает %icon_movement дальность перемещения на %spell1.spell.buff2.buff.stat.norm.\n%spell2.name: теперь существа, получившие урон от заклинания, дополнительно получают %spell2.spell.buff.buff.stat к %spell2.spell.buff.buff.stat.icon дальности перемещения. Длительность (ходов): %spell2.spell.buff.buff.durini.\n%spell3.name: теперь заклинание предотвращает at now the care в области 4x4.\n%spell4.name: теперь заклинание защищает союзников в области 4x4.\n%spell5.name: теперь заклинание замораживает противников с вероятностью 60%."

[A_MasterOfWater_II_Ability H7HeroAbility]
mName="Знание магии воды II"
mTooltip="%spell1.name и %spell2.name: теперь существа, получившие урон от этих заклинаний, дополнительно получают %spell1.spell.buff.buff.stat к %spell1.spell.buff.buff.stat.icon дальности перемещения. Длительность (ходов): %spell1.spell.buff.buff.durini.\n%spell3.name: теперь заклинание воздействует на область 4x4."